---
kind: property
id: P:Autodesk.Revit.DB.NestedFamilyTypeReference.CategoryId
source: html/18d2498d-d503-58c1-6c22-ac25cedf32e0.htm
---
# Autodesk.Revit.DB.NestedFamilyTypeReference.CategoryId Property

Category Id of the referenced family

## Syntax (C#)
```csharp
public ElementId CategoryId { get; }
```